
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.case_request_key
* Delete
  * azurerm_key_vault_secret.access_request_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.access_request_key will be destroyed
  # (because azurerm_key_vault_secret.access_request_key is not in configuration)
  - resource "azurerm_key_vault_secret" "access_request_key" {
      - id                      = "https://lau-aat.vault.azure.net/secrets/access-backend-encryption-key/d75f9d9401ea459ea0bac35f1de48ca1" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat" -> null
      - name                    = "access-backend-encryption-key" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat/secrets/access-backend-encryption-key/versions/d75f9d9401ea459ea0bac35f1de48ca1" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat/secrets/access-backend-encryption-key" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "d75f9d9401ea459ea0bac35f1de48ca1" -> null
      - versionless_id          = "https://lau-aat.vault.azure.net/secrets/access-backend-encryption-key" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.case_request_key will be created
  + resource "azurerm_key_vault_secret" "case_request_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"
      + name                    = "case-backend-encryption-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":768,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->